{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"lstm_input": {"name": "lstm_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "10"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lstm_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "10"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["lstm_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_input", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/sequential/lstm/zeros", "StatefulPartitionedCall/sequential/lstm/zeros_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {}, {}, {"dim": [{"size": "10"}, {"size": "1024"}]}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "1024"}]}]}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {}}, "parallel_iterations": {"i": "32"}, "cond": {"func": {"name": "__inference_while_cond_1117_22996"}}, "_num_original_outputs": {"i": "11"}, "body": {"func": {"name": "__inference_while_body_1118_19333"}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while:3", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/Shape", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while", "op": "StatelessWhile", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/loop_counter", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/maximum_iterations", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/time", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1", "StatefulPartitionedCall/sequential/lstm_1/zeros", "StatefulPartitionedCall/sequential/lstm_1/zeros_1", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {"dim": [{"size": "-1"}, {"size": "256"}]}, {}, {}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "256"}, {"size": "1024"}]}, {"dim": [{"size": "1024"}]}]}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {}}, "parallel_iterations": {"i": "32"}, "cond": {"func": {"name": "__inference_while_cond_1556_22622"}}, "_num_original_outputs": {"i": "11"}, "body": {"func": {"name": "__inference_while_body_1557_20259"}}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while:3", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_while_body_1118_19333", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_strided_slice_0", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel_0", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel_0", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_INT32"}, {"name": "while_identity_1", "type": "DT_INT32"}, {"name": "while_identity_2", "type": "DT_INT32"}, {"name": "while_identity_3", "type": "DT_VARIANT"}, {"name": "while_identity_4", "type": "DT_FLOAT"}, {"name": "while_identity_5", "type": "DT_FLOAT"}, {"name": "while_strided_slice", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_1118_19333/while/add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_1118_19333/while/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_1118_19333/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_1118_19333/while/add_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "while/MatMul_1", "op": "MatMul", "input": ["while_placeholder_2", "while_matmul_1_recurrent_kernel_0"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "while/add_2", "op": "AddV2", "input": ["while_placeholder", "__inference_while_body_1118_19333/while/add_2/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_placeholder", "__inference_while_body_1118_19333/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "while/add_3", "op": "AddV2", "input": ["while_while_loop_counter", "__inference_while_body_1118_19333/while/add_3/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/MatMul", "op": "MatMul", "input": ["while/TensorArrayV2Read/TensorListGetItem:item:0", "while_matmul_kernel_0"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "while/add", "op": "AddV2", "input": ["while/MatMul:product:0", "while/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/BiasAdd", "op": "BiasAdd", "input": ["while/add:z:0", "while_biasadd_bias_0"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "while/split", "op": "Split", "input": ["__inference_while_body_1118_19333/while/split/split_dim:output:0", "while/BiasAdd:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "while/Sigmoid", "op": "Sigmoid", "input": ["while/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_1", "op": "Sigmoid", "input": ["while/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh", "op": "Tanh", "input": ["while/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_2", "op": "Sigmoid", "input": ["while/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul", "op": "Mul", "input": ["while/Sigmoid_1:y:0", "while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_1", "op": "Mul", "input": ["while/Sigmoid:y:0", "while/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/add_1", "op": "AddV2", "input": ["while/mul:z:0", "while/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh_1", "op": "Tanh", "input": ["while/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_2", "op": "Mul", "input": ["while/Sigmoid_2:y:0", "while/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["while_placeholder_1", "while_placeholder", "while/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}], "ret": {"while_matmul_1_recurrent_kernel": "while_matmul_1_recurrent_kernel_0", "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_strided_slice": "while_strided_slice_0", "while_identity_1": "while_while_maximum_iterations", "while_identity_2": "while/add_2:z:0", "while_matmul_kernel": "while_matmul_kernel_0", "while_identity_3": "while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "while_identity_4": "while/mul_2:z:0", "while_identity_5": "while/add_1:z:0", "while_identity": "while/add_3:z:0", "while_biasadd_bias": "while_biasadd_bias_0"}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "256"}, {"size": "1024"}]}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "10"}, {"size": "1024"}]}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1024"}]}]}}}}}}, {"signature": {"name": "__inference_while_cond_1117_22996", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_less_strided_slice", "type": "DT_INT32"}, {"name": "while_while_cond_1117___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "while_while_cond_1117___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_while_cond_1117___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "while_while_cond_1117___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "while/Less", "op": "Less", "input": ["while_placeholder", "while_less_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"while_identity": "while/Less:z:0"}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}}}, {"signature": {"name": "__inference_while_cond_1556_22622", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_less_strided_slice", "type": "DT_INT32"}, {"name": "while_while_cond_1556___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "while_while_cond_1556___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_while_cond_1556___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "while_while_cond_1556___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "while/Less", "op": "Less", "input": ["while_placeholder", "while_less_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"while_identity": "while/Less:z:0"}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}}}, {"signature": {"name": "__inference_while_body_1557_20259", "inputArg": [{"name": "while_while_loop_counter", "type": "DT_INT32"}, {"name": "while_while_maximum_iterations", "type": "DT_INT32"}, {"name": "while_placeholder", "type": "DT_INT32"}, {"name": "while_placeholder_1", "type": "DT_VARIANT"}, {"name": "while_placeholder_2", "type": "DT_FLOAT"}, {"name": "while_placeholder_3", "type": "DT_FLOAT"}, {"name": "while_strided_slice_0", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel_0", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel_0", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "while_identity", "type": "DT_INT32"}, {"name": "while_identity_1", "type": "DT_INT32"}, {"name": "while_identity_2", "type": "DT_INT32"}, {"name": "while_identity_3", "type": "DT_VARIANT"}, {"name": "while_identity_4", "type": "DT_FLOAT"}, {"name": "while_identity_5", "type": "DT_FLOAT"}, {"name": "while_strided_slice", "type": "DT_INT32"}, {"name": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "while_matmul_kernel", "type": "DT_FLOAT"}, {"name": "while_matmul_1_recurrent_kernel", "type": "DT_FLOAT"}, {"name": "while_biasadd_bias", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_1557_20259/while/add_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_1557_20259/while/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_1557_20259/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_1557_20259/while/add_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "while/MatMul_1", "op": "MatMul", "input": ["while_placeholder_2", "while_matmul_1_recurrent_kernel_0"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "while/add_2", "op": "AddV2", "input": ["while_placeholder", "__inference_while_body_1557_20259/while/add_2/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_placeholder", "__inference_while_body_1557_20259/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "while/add_3", "op": "AddV2", "input": ["while_while_loop_counter", "__inference_while_body_1557_20259/while/add_3/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "while/MatMul", "op": "MatMul", "input": ["while/TensorArrayV2Read/TensorListGetItem:item:0", "while_matmul_kernel_0"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "while/add", "op": "AddV2", "input": ["while/MatMul:product:0", "while/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/BiasAdd", "op": "BiasAdd", "input": ["while/add:z:0", "while_biasadd_bias_0"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "while/split", "op": "Split", "input": ["__inference_while_body_1557_20259/while/split/split_dim:output:0", "while/BiasAdd:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "while/Sigmoid", "op": "Sigmoid", "input": ["while/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_1", "op": "Sigmoid", "input": ["while/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh", "op": "Tanh", "input": ["while/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Sigmoid_2", "op": "Sigmoid", "input": ["while/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul", "op": "Mul", "input": ["while/Sigmoid_1:y:0", "while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_1", "op": "Mul", "input": ["while/Sigmoid:y:0", "while/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/add_1", "op": "AddV2", "input": ["while/mul:z:0", "while/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/Tanh_1", "op": "Tanh", "input": ["while/add_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/mul_2", "op": "Mul", "input": ["while/Sigmoid_2:y:0", "while/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["while_placeholder_1", "while_placeholder", "while/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}], "ret": {"while_matmul_1_recurrent_kernel": "while_matmul_1_recurrent_kernel_0", "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor": "while_tensorarrayv2read_tensorlistgetitem_tensorarrayunstack_tensorlistfromtensor_0", "while_strided_slice": "while_strided_slice_0", "while_identity_1": "while_while_maximum_iterations", "while_identity_2": "while/add_2:z:0", "while_matmul_kernel": "while_matmul_kernel_0", "while_identity_3": "while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "while_identity_4": "while/mul_2:z:0", "while_identity_5": "while/add_1:z:0", "while_identity": "while/add_3:z:0", "while_biasadd_bias": "while_biasadd_bias_0"}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "256"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "9": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "256"}, {"size": "1024"}]}]}}}}, "8": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "256"}, {"size": "1024"}]}]}}}}, "10": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "1024"}]}]}}}}}}]}, "versions": {"producer": 440, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/maximum_iterations", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/maximum_iterations", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [10, 1024], "dtype": "float32"}, {"name": "unknown_0", "shape": [256, 1024], "dtype": "float32"}, {"name": "unknown_1", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "unknown_2", "shape": [256, 1024], "dtype": "float32"}, {"name": "unknown_3", "shape": [256, 1024], "dtype": "float32"}, {"name": "unknown_4", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "unknown_5", "shape": [256, 10], "dtype": "float32"}, {"name": "unknown_6", "shape": [10], "dtype": "float32"}, {"name": "__inference_while_body_1118_19333/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_1118_19333/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_1118_19333/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "__inference_while_body_1118_19333/while/add_3/y", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_1557_20259/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_1557_20259/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_1557_20259/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "__inference_while_body_1557_20259/while/add_3/y", "shape": [], "dtype": "int32"}]}]}